# Data Science - Sales Analysis

In [11]:
import pandas as pd
import os

### 1 - Merging multiple data files into a single file

In [13]:
files = [file for file in os.listdir('Sales_Data')]
for file in files:
    print(file)

Sales_July_2019.csv
Sales_October_2019.csv
Sales_December_2019.csv
Sales_April_2019.csv
Sales_January_2019.csv
Sales_June_2019.csv
Sales_February_2019.csv
Sales_November_2019.csv
Sales_September_2019.csv
Sales_March_2019.csv
Sales_August_2019.csv
Sales_May_2019.csv

In [18]:
files = [file for file in os.listdir('Sales_Data')]

all_months_data = pd.DataFrame()

for file in files:
    df = pd.read_csv('Sales_Data/'+file)
    all_months_data = pd.concat([all_months_data, df])
    
all_months_data.to_csv('all_data.csv', index=False)

In [19]:
all_data = pd.read_csv('all_data.csv')
all_data.tail()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
186845,209916,Bose SoundSport Headphones,1,99.99,05/08/19 19:15,"235 Center St, Seattle, WA 98101"
186846,209917,Wired Headphones,1,11.99,05/24/19 22:02,"926 9th St, San Francisco, CA 94016"
186847,209918,AAA Batteries (4-pack),2,2.99,05/24/19 17:44,"868 Hickory St, Boston, MA 02215"
186848,209919,USB-C Charging Cable,1,11.95,05/04/19 12:46,"204 Adams St, Seattle, WA 98101"
186849,209920,ThinkPad Laptop,1,999.99,05/18/19 23:07,"43 5th St, Atlanta, GA 30301"

### 2 - Add month column

In [25]:
all_data['Month'] = all_data['Order Date'].str[:2]
all_data.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,222910,Apple Airpods Headphones,1,150,07/26/19 16:51,"389 South St, Atlanta, GA 30301",07
1,222911,Flatscreen TV,1,300,07/05/19 08:55,"590 4th St, Seattle, WA 98101",07
2,222912,AA Batteries (4-pack),1,3.84,07/29/19 12:41,"861 Hill St, Atlanta, GA 30301",07

### 3 - Clean up the data

In [32]:
df_nan = all_data[all_data.isna().any(axis=1)]   #All nan data in df. "axis=1 -> At least one at a column"
df_nan.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
199,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,NaN,NaN,NaN,NaN,NaN,NaN,NaN
599,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
# Delete the row if every fields are NaN # how=any to delete row if appears at least one.
all_data = all_data.dropna(how='all')

In [49]:
all_data.groupby('Month').count() # I did it to see if appears another value isntead of months

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
Month,,,,,,
01,9709,9709,9709,9709,9709,9709
02,11975,11975,11975,11975,11975,11975
03,15153,15153,15153,15153,15153,15153
04,18279,18279,18279,18279,18279,18279
05,16566,16566,16566,16566,16566,16566
06,13554,13554,13554,13554,13554,13554
07,14293,14293,14293,14293,14293,14293
08,11961,11961,11961,11961,11961,11961
09,11621,11621,11621,11621,11621,11621
10,20282,20282,20282,20282,20282,20282
11,17573,17573,17573,17573,17573,17573
12,24984,24984,24984,24984,24984,24984
Or,355,355,355,355,355,355

### Delete 'Or

In [50]:
all_data = all_data[all_data['Month'].str[:2] != 'Or']

In [53]:
all_data['Month'] = all_data['Month'].astype('int32') # Converting Month into an int32
all_data.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,222910,Apple Airpods Headphones,1,150,07/26/19 16:51,"389 South St, Atlanta, GA 30301",7
1,222911,Flatscreen TV,1,300,07/05/19 08:55,"590 4th St, Seattle, WA 98101",7
2,222912,AA Batteries (4-pack),1,3.84,07/29/19 12:41,"861 Hill St, Atlanta, GA 30301",7

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
Month,,,,,,
01,9709,9709,9709,9709,9709,9709
02,11975,11975,11975,11975,11975,11975
03,15153,15153,15153,15153,15153,15153
04,18279,18279,18279,18279,18279,18279
05,16566,16566,16566,16566,16566,16566
06,13554,13554,13554,13554,13554,13554
07,14293,14293,14293,14293,14293,14293
08,11961,11961,11961,11961,11961,11961
09,11621,11621,11621,11621,11621,11621
10,20282,20282,20282,20282,20282,20282
11,17573,17573,17573,17573,17573,17573
12,24984,24984,24984,24984,24984,24984